chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
/************************ 陀螺静态零偏自动校准 ************************/
/**
 * @brief 设备静止时自动微调Z轴陀螺零偏，抑制温度漂移
 * 仅保存至内存，不写入Flash，上电重置
 */

/************************ 四元数辅助函数 ************************/
static void quat_normalize(void) {
  float norm = sqrtf(quat.w * quat.w + quat.x * quat.x + quat.y * quat.y +
                     quat.z * quat.z);
  if (norm > 0.0001f) {
    quat.w /= norm;
    quat.x /= norm;
    quat.y /= norm;
    quat.z /= norm;
  }
}

static void euler_to_quat(float pitch_deg, float roll_deg, float yaw_deg) {
  float p = pitch_deg * 0.0174533f * 0.5f; /* θ/2 */
  float r = roll_deg * 0.0174533f * 0.5f;  /* φ/2 */
  float y = yaw_deg * 0.0174533f * 0.5f;   /* ψ/2 */

  float cp = cosf(p), sp = sinf(p);
  float cr = cosf(r), sr = sinf(r);
  float cy = cosf(y), sy = sinf(y);

  /* 标准ZYX四元数（q1=roll分量, q2=pitch分量），与 Mahony 修正和
     四元数→欧拉角提取(vx/vy/vz)的约定保持一致。
     原实现 q1/q2 反了，导致 Mahony 修正方向错误→姿态缓慢漂移→
     累积到总倾斜90°时 roll 提取进入奇异点，跳到±180°来回振荡。 */
  quat.w = cy * cp * cr + sy * sp * sr;
  quat.x = cy * cp * sr - sy * sp * cr;
  quat.y = cy * sp * cr + sy * cp * sr;
  quat.z = sy * cp * cr - cy * sp * sr;

  quat_normalize();
}

/************************ 姿态解算算法 ************************/
/**
 * @brief 姿态解算（四元数版）
 * 内部使用四元数进行姿态更新，避免万向节锁
 * 输出仍然是欧拉角（pitch, roll, yaw_now）
 */
void attitude_calc_6axis(float ax, float ay, float az, float gx, float gy,
                         float gz, float temp) {
  // ====== 阶段0：静态变量（跨调用保持状态） ======
  static uint8_t first_run = 1;                // 首次运行标志，触发初始对准
  static float gx_bias = 0.0f, gy_bias = 0.0f; // 陀螺零偏估计值（在线校准）
  static float gx_sum = 0.0f, gy_sum = 0.0f, gz_sum = 0.0f; // 初始对准累加器
  static uint16_t init_cnt = 0;                             // 初始对准采样计数
  static float ix = 0.0f, iy = 0.0f, iz = 0.0f; // Mahony PI 控制器积分项
  static int temp_stable_cnt = 0;               // 温度稳定计数器
  static float last_temp = 0;                   // 上次温度值
  static int temp_diff_flag = 0;                // 温度变化标志
  // ====== 阶段1：初始对准（前1250次采样，约5秒） ======
  if (first_run) {
    gx_sum += gx;
    gy_sum += gy;
    gz_sum += gz;
    init_cnt++;

    if (init_cnt >= 1250) {       // 250Hz下1250帧=5秒初始对准
      // 1250次采样完成，求均值作为陀螺静态零偏
      gx_bias = gx_sum / 1250.0f;
      gy_bias = gy_sum / 1250.0f;
      gyro_bias.gz_bias = gz_sum / 1250.0f;
      gyro_bias.temp_ref = temp;
      last_temp = temp;
      // 用加速度计计算初始姿态角，初始化四元数（yaw=0）
      float accel_pitch = atan2f(-ax, sqrtf(ay * ay + az * az)) * 57.3f;
      float accel_roll = atan2f(ay, az) * 57.3f;
      euler_to_quat(accel_pitch, accel_roll, att.yaw_now);

      first_run = 0;
    } else {
      // 初始化未完成，仅输出加速度计姿态，不积分
      float accel_pitch = atan2f(-ax, sqrtf(ay * ay + az * az)) * 57.3f;
      float accel_roll = atan2f(ay, az) * 57.3f;
      att.pitch = accel_pitch;
      att.roll = accel_roll;
      att.yaw_now = att.yaw_now;
      return;
    }
  }

  // ====== 阶段2：陀螺零偏补偿 ======
  float gx_comp = gx - gx_bias;
  float gy_comp = gy - gy_bias;
  float gz_comp = gz - gyro_bias.gz_bias;
  // ====== 阶段3：静止检测（原始值 + 温度自适应阈值） ======
  // 阈值随温度缩放：|T - 25°C| 越大，温漂零偏可能越大，阈值相应放宽。
  // 用原始值判静止需覆盖手册零偏包络 ZRO(T)=ZRO(25°C)+0.015*(T-25)，
  // 保证静止设备不会因零偏随温度漂移而被误判为运动（避免零偏更新死锁）。
  float stable_thresh = STABLE_THRESH_BASE +
                        STABLE_THRESH_TEMP_COEFF * fabsf(temp - ZRO_TEMP_REF);
  if (stable_thresh > STABLE_THRESH_MAX) {
    stable_thresh = STABLE_THRESH_MAX;
  }

  static uint16_t stable_cnt = 0;                    // 连续静止采样计数
  uint8_t is_stable = (fabsf(gx) < stable_thresh) && // 三轴原始角速度均低于
                      (fabsf(gy) < stable_thresh) && // 温度自适应阈值才判静止
                      (fabsf(gz) < stable_thresh);
  // printf("stable_cnt=%d, is_stable=%d, gx_comp=%.2f, gy_comp=%.2f,
  // gz_comp=%.2f\r\n", stable_cnt, is_stable, gx_comp, gy_comp, gz_comp);
  if (is_stable) {
    stable_cnt++;
  } else {
    stable_cnt = 0;
    // 运动时清零 Mahony 积分项，防止积分饱和
    ix *=
        0.9980f; // 运动时指数衰减积分项（250Hz折算，保持每秒衰减~0.6）
    iy *= 0.9980f;
    iz *= 0.9980f;
  }

  // ====== 阶段4：陀螺积分 → 四元数增量（一阶龙格库塔法） ======
  float q0 = quat.w, q1 = quat.x, q2 = quat.y, q3 = quat.z;

  // ====== 阶段4.1：反演锁死检测与恢复 ======
  // 若估计重力 v 与实测重力 a 方向相反（点积<0），说明滤波器锁死在 180°
  // 倒立解（ 叉积误差在 180°
  // 处为0，拉不回来）。此时用加速度计重新初始化四元数，立即拉回正确姿态。
  // 仅当加速度模长≈1g 时判定，避免剧烈运动误触发。
  {
    float acc_norm_chk = sqrtf(ax * ax + ay * ay + az * az);
    if (acc_norm_chk > 0.9f && acc_norm_chk < 1.1f) {
      float ax_n = ax / acc_norm_chk, ay_n = ay / acc_norm_chk,
            az_n = az / acc_norm_chk;
      float vx_c = 2.0f * (q1 * q3 - q0 * q2);
      float vy_c = 2.0f * (q0 * q1 + q2 * q3);
      float vz_c = q0 * q0 - q1 * q1 - q2 * q2 + q3 * q3;
      if (vx_c * ax_n + vy_c * ay_n + vz_c * az_n < 0.0f) {
        /* 反演锁死：用加速度计重新初始化四元数，保持当前 yaw */
        float accel_pitch = atan2f(-ax, sqrtf(ay * ay + az * az)) * 57.3f;
        float accel_roll = atan2f(ay, az) * 57.3f;
        euler_to_quat(accel_pitch, accel_roll, att.yaw_now);
        ix = 0.0f;
        iy = 0.0f;
        iz = 0.0f; /* 清积分项 */
        q0 = quat.w;
        q1 = quat.x;
        q2 = quat.y;
        q3 = quat.z; /* 用新四元数继续 */
      }
    }
  }

  float gx_rad = gx_comp * 0.0174533f; // °/s → rad/s
  float gy_rad = gy_comp * 0.0174533f;
  float gz_rad = gz_comp * 0.0174533f;

  float half_dt = DT * 0.5f; // 半采样周期

  // 四元数微分方程: dq/dt = 0.5 * q ⊗ ω
  float dq0 = (-q1 * gx_rad - q2 * gy_rad - q3 * gz_rad) * half_dt;
  float dq1 = (q0 * gx_rad + q2 * gz_rad - q3 * gy_rad) * half_dt;
  float dq2 = (q0 * gy_rad - q1 * gz_rad + q3 * gx_rad) * half_dt;
  float dq3 = (q0 * gz_rad + q1 * gy_rad - q2 * gx_rad) * half_dt;

  // ====== 阶段5：加速度计 Mahony 互补滤波修正（仅修正 pitch/roll） ======
  float acc_norm = sqrtf(ax * ax + ay * ay + az * az);
  // 条件：连续静止 > 100ms（250Hz下25帧）且加速度模长接近 1g（排除剧烈运动干扰）
  if (stable_cnt > 25 && acc_norm > 0.9f && acc_norm < 1.1f) {
    float ax_n = ax / acc_norm; // 归一化加速度
    float ay_n = ay / acc_norm;
    float az_n = az / acc_norm;

    // 从当前四元数提取重力方向在机体坐标系下的投影（理论值）
    float vx = 2.0f * (q1 * q3 - q0 * q2);
    float vy = 2.0f * (q0 * q1 + q2 * q3);
    float vz = q0 * q0 - q1 * q1 - q2 * q2 + q3 * q3;

    // 叉积求姿态误差：加速度实测值 × 四元数估计值
    float ex = ay_n * vz - az_n * vy;
    float ey = az_n * vx - ax_n * vz;
    float ez = ax_n * vy - ay_n * vx;

    // PI 控制器：比例项快速收敛 + 积分项消除稳态误差
    const float Kp = 5.0f;    // 比例增益（τ=1/Kp≈0.2s，与采样率无关）
    const float Ki = 0.0012f; // 积分增益（按250Hz折算：0.003×100/250）
    ix += ex * Ki;
    iy += ey * Ki;
    iz += ez * Ki;

    // 积分限幅：防止积分项饱和后把姿态推跑（自激翻滚的诱因之一）
    const float I_LIMIT = 0.5f;
    if (ix > I_LIMIT)
      ix = I_LIMIT;
    else if (ix < -I_LIMIT)
      ix = -I_LIMIT;
    if (iy > I_LIMIT)
      iy = I_LIMIT;
    else if (iy < -I_LIMIT)
      iy = -I_LIMIT;
    if (iz > I_LIMIT)
      iz = I_LIMIT;
    else if (iz < -I_LIMIT)
      iz = -I_LIMIT;

