chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
    // printf(" ez = %.4f, iz = %.4f, yaw=%.5f, gz_bias=%.5f\r\n", ez, iz,
    // att.yaw_now, gyro_bias.gz_bias);

    // 将修正量叠加到四元数增量（d3 修正 pitch/roll，不修正 yaw）
    dq1 += (ex * Kp + ix) * half_dt;
    dq2 += (ey * Kp + iy) * half_dt;
    dq3 += (ez * Kp + iz) * half_dt;
  }

  // ====== 阶段6：更新四元数并归一化 ======
  quat.w += dq0;
  quat.x += dq1;
  quat.y += dq2;
  quat.z += dq3;

  quat_normalize();

  // ====== 阶段8：四元数 → 欧拉角输出 ======
  q0 = quat.w;
  q1 = quat.x;
  q2 = quat.y;
  q3 = quat.z;

  // 重力方向在机体坐标系下的投影
  float vx = 2.0f * (q1 * q3 - q0 * q2);
  float vy = 2.0f * (q0 * q1 + q2 * q3);
  float vz = q0 * q0 - q1 * q1 - q2 * q2 + q3 * q3;

  att.pitch = -atan2f(-vx, sqrtf(vy * vy + vz * vz)) * 57.3f;
  att.roll = -atan2f(vy, vz) * 57.3f;

  // ====== 阶段7：长时间静止时在线校准陀螺零偏 ======
  temp_stable_cnt++;
  if (temp_stable_cnt % 7500 == 0) { // 250Hz下7500帧=30s，检测温度变化
    if (fabsf(temp - last_temp) >= 0.3f) {
      last_temp = temp;
      temp_stable_cnt = 0;
      temp_diff_flag = 1;
    } else {
      temp_diff_flag = 0;
    }
  }
  if (stable_cnt > 1250) {
    float alpha = temp_diff_flag ? 0.1f : 0.001f; // 快修正 / 慢修正
    gx_bias = gx_bias * (1.0f - alpha) + gx * alpha;
    gy_bias = gy_bias * (1.0f - alpha) + gy * alpha;
    gyro_bias.gz_bias = gyro_bias.gz_bias * (1.0f - alpha) + gz * alpha;
  } else {
    // 航向角纯陀螺积分（6轴模式无磁力计修正）
    att.yaw_now += gz_comp * DT;
  }
  // att.yaw_now += gz_comp * DT;
  // printf("is_stable=%d, yaw=%.5f, gz_bias=%.5f\r\n", is_stable, att.yaw_now,
  //        gyro_bias.gz_bias);
  // 角度归一化到 [-180°, 180°]
  while (att.yaw_now > 180.0f) {
    att.yaw_now -= 360.0f;
  }

  while (att.yaw_now < -180.0f) {
    att.yaw_now += 360.0f;
  }
}

/**
 * @brief 夜间9轴融合解算（无大车干扰，地磁缓慢修正Yaw积分漂移）
 */
void attitude_calc_9axis(void) {
  attitude_calc_6axis(-icm_raw.az, icm_raw.ay, icm_raw.ax, -icm_raw.gz,
                      icm_raw.gy, icm_raw.gx, icm_raw.temp);

  // 磁力计修正：仅在夜间模式、静止且无地磁干扰时执行
  if (day_mode == 0 && mag_disturb_flag == 0) {
    float pitch_rad = att.pitch * 0.0174533f;
    float cos_p = cosf(pitch_rad);

    if (fabsf(cos_p) > 0.15f) {
      float roll_rad = att.roll * 0.0174533f;
      float sin_p = sinf(pitch_rad);
      float cos_r = cosf(roll_rad);
      float sin_r = sinf(roll_rad);

      float mx_h = mag_raw.mx * cos_p + mag_raw.mz * sin_p;
      float my_h = mag_raw.mx * sin_r * sin_p + mag_raw.my * cos_r -
                   mag_raw.mz * sin_r * cos_p;

      float mag_yaw = atan2f(my_h, mx_h) * 57.3f;
      float yaw_err = mag_yaw - att.yaw_now;
      if (yaw_err > 180.0f)
        yaw_err -= 360.0f;
      if (yaw_err < -180.0f)
        yaw_err += 360.0f;

      att.yaw_now += yaw_err * 0.01f;
    }
  }
}

/************************ RS485串口上报函数 ************************/
/**
 * @brief 串口发送字符串
 */
void usart_send_string(char *str) {
  uint16_t len = strlen(str);
  for (uint16_t i = 0; i < len; i++) {
    while (usart_flag_get(USART_RS485, USART_FLAG_TBE) == RESET)
      ;
    usart_data_transmit(USART_RS485, str[i]);
  }
  while (usart_flag_get(USART_RS485, USART_FLAG_TC) == RESET)
    ;
}

/**
 * @brief 发送报警信息
 * @param fault_type:0x01倾斜故障 0x02旋转故障 0x03同时故障
 */
void send_alarm_info(uint8_t fault_type, float pit, float rol, float yaw) {
  static uint16_t alarm_print_cnt = 0;
  alarm_print_cnt++;
  if (alarm_print_cnt >= 100) {
    char buf[64] = {0};
    // sprintf(buf, "FAULT:%d,P=%.1f,R=%.1f,Y=%.1f\r\n", fault_type, pit, rol,
    //         yaw);
    // printf("%s", buf);
    alarm_print_cnt = 0;
  }
}

/************************ 昼夜模式切换（RTC小时判定） ************************/
void update_day_night_mode(uint8_t rtc_hour) {
  // 6点~22点白天6轴模式，其余夜间9轴融合
  if (rtc_hour >= 6 && rtc_hour < 22)
    day_mode = 1;
  else
    day_mode = 0;
}

/************************ 主循环调度函数（4ms定时调用）
 * ************************/
/**
 * @brief 定时4ms执行一次（250Hz），传入RTC当前小时
 */
void imu_main_loop(uint8_t rtc_hour) {
  // 更新昼夜工作模式
  // printf("main loop\n");
  // usart_interrupt_enable(USART0, USART_INT_TBE);
  update_day_night_mode(rtc_hour);

  // 采集传感器原始数据
  icm42670_get_raw_data();
  qmc5883p_get_raw_data();
  static int16_t loop_cnt = 0;
  loop_cnt++;
  if (loop_cnt % 25 == 0) {  // 250Hz下每25帧=100ms检测一次地磁
    // 检测前后地磁向量模长，参数值判断磁场是否被干扰
    mag_disturb_detect();
  } else {
    loop_cnt = 0;
  }

  // 分时姿态解算
  //   if (day_mode == 1)
  attitude_calc_6axis(-icm_raw.az, icm_raw.ay, icm_raw.ax, -icm_raw.gz,
                      icm_raw.gy, icm_raw.gx, icm_raw.temp);
  //   else
  //   attitude_calc_9axis();

  // 计算当前角度相对安装零点的偏移量
  float yaw_offset = fabsf(att.yaw_now - att.yaw_base);
  if (yaw_offset > 180.0f)
    yaw_offset = 360.0f - yaw_offset;
  float pit_offset = fabsf(att.pitch - att.pitch_base);
  float rol_offset = fabsf(att.roll - att.roll_base);

  uint8_t alarm_level = 0x00;
  // 检查严重偏转（超过严重阈值）
  if (pit_offset >= pitch_severe_threshold ||
      rol_offset >= roll_severe_threshold ||
      yaw_offset >= yaw_severe_threshold) {
    alarm_level = 0x02;
  }
  // 检查轻微偏转（超过轻微阈值，但未达严重）
  else if (pit_offset >= pitch_mild_threshold ||
           rol_offset >= roll_mild_threshold ||
           yaw_offset >= yaw_mild_threshold) {
    alarm_level = 0x01;
  }

  // 防抖滤波（预警时间可运行时修改）
  uint32_t alarm_time_max = alarm_warning_time * 250; // 250Hz下每秒250帧
  if (alarm_level != 0x00) {
    alarm_filter_cnt++;
    if (alarm_filter_cnt > alarm_time_max) {
      fault_type = alarm_level;
      alarm_filter_cnt = alarm_time_max;
    }
  } else {
    alarm_filter_cnt = 0;
    fault_type = 0x00;
  }

  // 航向角断电保存（环形缓冲，内部自动判断写入时机）
  save_yaw_to_flash(att.yaw_now);
}

/************************ 系统总初始化入口 ************************/
/**
 * @brief 传感器系统初始化
 * 外部需提前初始化：GPIO、I2C0/I2C1、USART1、Systick、RTC、定时器
 */
void imu_system_init(void) {
  icm42670_init();
  qmc5883p_init();
  load_install_zero_point(); // 上电加载安装标定零点
  load_alarm_config();       // 上电加载报警参数
  load_yaw_from_flash();     // 上电恢复断电前航向角
}

// ## 外部补充初始化说明（需要自行添加）
// 1. `delay_ms()`：基于Systick实现毫秒延时函数；
// 2. I2C0、I2C1 GPIO+外设初始化；
// 3. USART1串口初始化（RS485收发）；
// 4. 定时器4ms中断，循环调用 `imu_main_loop(rtc_hour)`；
// 5. RTC时钟读取小时，传入主循环；
// 6. 上位机下发标定指令时调用 `save_install_zero_point()` 保存安装零点。

// ## 核心业务逻辑亮点
// 1.
// **大车磁场干扰规避**：白天车流高峰自动关闭地磁航向融合，仅用陀螺积分计算绕杆旋转，不会因货车金属车体造成角度跳变误报警；
// 2.
// **三轴统一报警**：俯仰X、横滚Y、旋转Z任意一轴偏移＞10°，持续2秒稳定后上报，区分倾斜/旋转两种故障码；
// 3. **断电保存标定零点**：Flash双备份存储安装基准，设备拆装后无需重新标定；
// 4. **陀螺温漂抑制**：设备静止时自动平滑更新Z轴零偏，长期运行角度漂移小；
// 5.
// **夜间漂移修正**：夜间车流稀少，地磁缓慢修正陀螺长时间积分误差，保证长期精度。

