chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
  /* 5. 配置 NVIC 中断优先级并使能中断 */
  nvic_irq_enable(TIMER1_IRQn, 0, 1);

  /* 6. 启动定时器 */
  timer_enable(TIMER1);
}

/************************ 软I2C诊断（验证0x68器件用，确认后可删除）
 * ************************/
static void diag_scl(uint8_t level) {
  if (level)
    gpio_bit_set(GPIOA, GPIO_PIN_0);
  else
    gpio_bit_reset(GPIOA, GPIO_PIN_0);
}
static void diag_sda(uint8_t level) {
  if (level)
    gpio_bit_set(GPIOA, GPIO_PIN_1);
  else
    gpio_bit_reset(GPIOA, GPIO_PIN_1);
}
static uint8_t diag_sda_in(void) {
  return gpio_input_bit_get(GPIOA, GPIO_PIN_1);
}
static void diag_start(void) {
  diag_sda(1);
  diag_scl(1);
  delay_us(5);
  diag_sda(0);
  delay_us(5);
  diag_scl(0);
  delay_us(5);
}
static void diag_stop(void) {
  diag_sda(0);
  diag_scl(1);
  delay_us(5);
  diag_sda(1);
  delay_us(5);
}
static uint8_t diag_send_byte(uint8_t byte) {
  uint8_t i, ack;
  for (i = 0; i < 8; i++) {
    diag_scl(0);
    delay_us(3);
    if (byte & 0x80)
      diag_sda(1);
    else
      diag_sda(0);
    delay_us(2);
    diag_scl(1);
    delay_us(5);
    byte <<= 1;
  }
  diag_scl(0);
  delay_us(3);
  diag_sda(1);
  delay_us(2);
  diag_scl(1);
  delay_us(5);
  ack = diag_sda_in(); /* 0=器件拉低SDA=ACK, 1=NACK */
  diag_scl(0);
  delay_us(5);
  return (ack == 0) ? 0 : 1;
}
/* 诊断用读字节函数，已注释
static uint8_t diag_read_byte(uint8_t ack_bit) {
  uint8_t i, byte = 0;
  diag_sda(1);
  for (i = 0; i < 8; i++) {
    diag_scl(0); delay_us(5);
    diag_scl(1); delay_us(3);
    byte <<= 1;
    if (diag_sda_in()) byte |= 0x01;
    delay_us(2);
  }
  diag_scl(0); delay_us(3);
  if (ack_bit) diag_sda(0); else diag_sda(1);
  delay_us(2); diag_scl(1); delay_us(5);
  diag_scl(0); delay_us(5);
  return byte;
}
*/
static void diag_reg_write(uint8_t dev, uint8_t reg, uint8_t data) {
  diag_start();
  diag_send_byte(dev << 1);
  diag_send_byte(reg);
  diag_send_byte(data);
  diag_stop();
}
/* 开机软I2C读WHO_AM_I诊断（调试用，已注释，正式运行不需要） */
// static void soft_i2c_whoami_diag(void) {
//   uint8_t ack_w, ack_reg, ack_r, who;
//
//   printf("\r\n[DIAG] Soft-I2C read WHO_AM_I: dev=0x68 reg=0x75 ...\r\n");
//
//   gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, GPIO_PIN_0 |
//   GPIO_PIN_1); gpio_output_options_set(GPIOA, GPIO_OTYPE_OD,
//   GPIO_OSPEED_50MHZ, GPIO_PIN_0 | GPIO_PIN_1); diag_scl(1); diag_sda(1);
//   delay_1ms(2);
//
//   diag_start();
//   ack_w   = diag_send_byte(0x68 << 1);       /* 写地址 0xD0 */
//   ack_reg = diag_send_byte(0x75);            /* 寄存器 0x75 */
//   diag_start();                              /* RESTART */
//   ack_r   = diag_send_byte((0x68 << 1) | 1); /* 读地址 0xD1 */
//   who = diag_read_byte(0);                   /* 读1字节 + NACK */
//   diag_stop();
//
//   printf("[DIAG] ACK: addrW=%s reg=%s addrR=%s | WHO_AM_I=0x%02X %s\r\n",
//          ack_w ? "NACK" : "ACK", ack_reg ? "NACK" : "ACK", ack_r ? "NACK" :
//          "ACK", who, (who == 0x67) ? "(OK 0x67)" : "(NOT 0x67!)");
// }

int main(void) {

  /* App 链接在 0x08002000（bootloader 之后），启动必须把中断向量表重定位到 App
   * 区 */
  SCB->VTOR = 0x08002000U;

  /* bootloader 跳转前调用了 __disable_irq() 关掉全局中断，必须恢复，
     否则 SysTick 中断不触发 → delay_1ms()/delay_ms() 会死循环卡死 */
  __enable_irq();

  systick_config();
  com_usart_init();
  printf("%x", main);
  printf("[APP] started\r\n");

  // soft_i2c_whoami_diag();   /*
  // 开机软I2C读WHO_AM_I诊断：调试用，正式运行注释掉 */ printf("Hellow
  // word!\n"); sprintf(transmitter_buffer, "HELLO_world!\n");
  // usart_interrupt_enable(USART0, USART_INT_TBE);
  // delay_1ms(10);

  // txcount = 0;
  // usart_interrupt_enable(USART0, USART_INT_TBE);
  // printf("hello_word");
  /* configure RCU */
  /* I2C1 硬件初始化（hard_i2c_init 内部已配置 GPIO 和 I2C1 外设） */
  hard_i2c_init();

  /* I2C总线扫描 - 检测设备是否存在（调试用，正式运行注释掉）
  printf("=== I2C Bus Scan ===\n");
  for(uint8_t addr = 0x08; addr <= 0x77; addr++) {
    if(hard_i2c_probe(addr) == 0) {
      printf("  Device found at 7-bit addr: 0x%02X (8-bit: 0x%02X)\n", addr,
  addr << 1);
    }
  }
  printf("=== Scan Done ===\n");
  */
  // printf("I2C init done!\n");

  // i2c_test();

  // // soft_i2c_test();

  // gpio_config();
  // i2c_config();

  // i2c_test();

  imu_system_init();
  usart0_rx_dma_idle_init(); /* 配置USART0 DMA接收 + 空闲中断 */
  timer_config();
  // printf("timer init done!\n");

  static uint32_t debug_cnt = 0;
  while (1) {
    if (imu_loop_flag) {
      imu_main_loop(12);
      imu_loop_flag = 0;

      // debug_cnt++;
      // /* 0x82 与 0x8E 错开 500ms 发送：
      //    proto_send 对 usart0_tx_busy 是"直接丢弃"而非等待，
      //    背靠背连发会导致第二帧被丢弃 */
      // if (debug_cnt % 1000 == 0) {
      //   proto_send(0x82);
      // } else if (debug_cnt % 1000 == 500) {
      //   proto_send(0x8E);
      // }

      // printf("imu_tmp = %.4f\r\n", icm_raw.temp);
      // printf("mag_norm=%.4f,mag_x=%.4f,mag_y=%.4f,mag_z=%.4f\n",
      //        mag_raw.mag_norm, mag_raw.mx, mag_raw.my, mag_raw.mz);
      // printf("P=%.4f,R=%.4f,Y=%.4f\r\n", att.pitch, att.roll, att.yaw_now);
      // printf("ax=%.4f,ay=%.4f,az=%.4f\r\ngx=%.4f,gy=%.4f,gz=%.4f\r\n",
      //        icm_raw.ax, icm_raw.ay, icm_raw.az, icm_raw.gx, icm_raw.gy,
      //        icm_raw.gz);
      // printf("gx=%.4f,gy=%.4f,gz=%.4f\r\n", icm_raw.gx, icm_raw.gy,
      //        icm_raw.gz);
    }

    // 处理串口数据（空闲中断已计算 usart0_rx_len）
    if (usart0_rx_flag) {
      usart0_rx_flag = 0;
      if (usart0_rx_len >= 3) {
        uint8_t rx_cmd = usart0_rx_buffer[2];
        if (rx_cmd >= 0xF0) {
          /* OTA 远程烧录协议 */
          // printf("[DBG] ota_rx: len=%u b=%02X %02X %02X %02X %02X %02X\r\n",
          //        usart0_rx_len, usart0_rx_buffer[0], usart0_rx_buffer[1],
          //        usart0_rx_buffer[2], usart0_rx_buffer[3],
          //        usart0_rx_buffer[4], usart0_rx_buffer[5]);
          for (uint16_t i = 0; i < usart0_rx_len; i++) {
            ota_protocol_parse(usart0_rx_buffer[i]);
          }
        } else {
          /* 原有业务协议 */
          uint8_t calc_cs =
              calc_checksum(usart0_rx_buffer + 1, usart0_rx_len - 2);
          if (calc_cs != usart0_rx_buffer[usart0_rx_len - 1]) {
            /* 校验失败，丢弃此帧 */
          } else {
            proto_send(usart0_rx_buffer[2]);
          }
        }
      }
    }
  }
}